BAS BMEKZU Project/src/Documents/скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН/скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН</name>
  <registerRecords>InformationRegister.скEDI_ВипискиПоЛимитуРегистрацииВЕРНН</registerRecords>
  <attributes>
    <name>ОрганизацияEDI</name>
    <type>
      <types>CatalogRef.скEDI_Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайлаДФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КтоОформилЗапрос</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормированияОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияОтвета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклоненияДФС</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыпискаСтрока2Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследняяОперация</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Подписи</name>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>CatalogRef.скEDI_Подписи</types>
        <types>CatalogRef.скEDI_ГруппыПодписей</types>
      </type>
    </attributes>
    <attributes>
      <name>Подписано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодписиКонтрагента</name>
    <attributes>
      <name>ТелоСертификата</name>
      <comment>Base64-строка, построенная на основании двоичных данных файла сертификата</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяПодписанта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>511</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДолжностьПодписанта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подписано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодписания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Роль</name>
      <type>
        <types>EnumRef.скEDI_РолиПодписей</types>
      </type>
    </attributes>
    <attributes>
      <name>ДРФОПодписанта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТелоФаксимиле</name>
      <comment>Не используется</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>TSPСтатус</name>
      <type>
        <types>EnumRef.скEDI_TSPСтатус</types>
      </type>
    </attributes>
    <attributes>
      <name>OCSPСтатус</name>
      <type>
        <types>EnumRef.скEDI_OCSPСтатус</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

BAS BMEKZU Project/src/InformationRegisters/скEDI_ОтображениеЭлектронныхДокументов/скEDI_ОтображениеЭлектронныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>скEDI_ОтображениеЭлектронныхДокументов</name>
  <resources>
    <name>ОтображениеЭлектронныхДокументов</name>
    <type>
      <types>EnumRef.скEDI_ВариантыОтображенияЭлектронныхДокументов</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/скEDI_ВариантыОтображенияЭлектронныхДокументов/скEDI_ВариантыОтображенияЭлектронныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_ВариантыОтображенияЭлектронныхДокументов</name>
  <enumValues>
    <name>PDF</name>
  </enumValues>
  <enumValues>
    <name>Картинка</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС/скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Подписан</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоКвитанциюОтДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоПодтверждениеОтДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОтклонениеОтДФС</name>
  </enumValues>
  <enumValues>
    <name>ПолученоОтветОтДФС</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Enums/скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС/скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС</name>
  <enumValues>
    <name>Запрос</name>
  </enumValues>
  <enumValues>
    <name>Ответ</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

BAS BMEKZU Project/src/Documents/скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем мПредставлениеЭлектронногоДокументаPDF;
&НаКлиенте
Перем мПредставлениеЭлектронногоДокументаXML;
//&НаКлиенте
//Перем мПараметрыДляСозданияЭлектронногоДокумента;


&НаСервере
Процедура ПрименитьВариантОтображения()
	ОтображатьPDF = Ложь;
	ОтображатьКартинку = Ложь;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	скEDI_ОтображениеЭлектронныхДокументов.ОтображениеЭлектронныхДокументов,
	               |	ВЫБОР
	               |		КОГДА скEDI_ОтображениеЭлектронныхДокументов.Пользователь = &ТекПользователь
	               |			ТОГДА 1
	               |		ИНАЧЕ 2
	               |	КОНЕЦ КАК Порядок
	               |ИЗ
	               |	РегистрСведений.скEDI_ОтображениеЭлектронныхДокументов КАК скEDI_ОтображениеЭлектронныхДокументов
	               |ГДЕ
	               |	(скEDI_ОтображениеЭлектронныхДокументов.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |			ИЛИ скEDI_ОтображениеЭлектронныхДокументов.Пользователь = &ТекПользователь)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок";
	Запрос.УстановитьПараметр("ТекПользователь", скEDI_НастройкиПодКонфигурацию.ПолучитьТекущегоПользователя());
	ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
	Если ВыборкаРезультатаЗапроса.Следующий() Тогда
		Если ВыборкаРезультатаЗапроса.ОтображениеЭлектронныхДокументов = ПредопределенноеЗначение("Перечисление.скEDI_ВариантыОтображенияЭлектронныхДокументов.PDF") Тогда
			ОтображатьPDF = Истина;
		ИначеЕсли ВыборкаРезультатаЗапроса.ОтображениеЭлектронныхДокументов = ПредопределенноеЗначение("Перечисление.скEDI_ВариантыОтображенияЭлектронныхДокументов.Картинка") Тогда
			ОтображатьКартинку = Истина;
		КонецЕсли;
	Иначе
		ОтображатьКартинку = Истина;
	КонецЕсли;
	УстановитьВариантОтображения();
КонецПроцедуры

&НаСервере
Процедура УстановитьВариантОтображения()
	Если ОтображатьОшибку Тогда
		Элементы.ОтображениеОшибка.Видимость = Истина;
		Элементы.ГруппаОтображение.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		Элементы.ГруппаОтображение.ТекущаяСтраница = Элементы.ОтображениеОшибка;
		Элементы.ОтображениеОшибка.Доступность = Истина;
		Элементы.ОтображениеPDF.Доступность = Ложь;
		Элементы.ОтображениеКартинки.Доступность = Ложь;
	ИначеЕсли ОтображатьPDF и ОтображатьКартинку Тогда
		Элементы.ГруппаОтображение.ОтображениеСтраниц = ОтображениеСтраницФормы.ЗакладкиСверху;
		Элементы.ГруппаОтображение.ТекущаяСтраница = Элементы.ОтображениеPDF;
		Элементы.ОтображениеPDF.Доступность = Истина;
		Элементы.ОтображениеКартинки.Доступность = Истина;
		Элементы.ОтображениеОшибка.Видимость = Ложь;
		Элементы.ОтображениеОшибка.Доступность = Ложь;
	Иначе
		Элементы.ГруппаОтображение.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
		Элементы.ОтображениеОшибка.Видимость = Ложь;
		Если ОтображатьPDF Тогда
			Элементы.ГруппаОтображение.ТекущаяСтраница = Элементы.ОтображениеPDF;
			Элементы.ОтображениеPDF.Доступность = Истина;
		Иначе
			Элементы.ОтображениеPDF.Доступность = Ложь;
		КонецЕсли;
		Если ОтображатьКартинку Тогда
			Элементы.ГруппаОтображение.ТекущаяСтраница = Элементы.ОтображениеКартинки;
			Элементы.ОтображениеКартинки.Доступность = Истина;
		Иначе
			Элементы.ОтображениеКартинки.Доступность = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДанныеЭлектронногоДокументаИПоказатьИзображение();
	//Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	//Если СостояниеЭлектронногоДокумента = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.Создан") и ЗначениеЗаполнено(Документ1С) Тогда
	//		СформироватьДанныеЭлектронногоДокументаПоДокументу1С();
	//	//Иначе
	//		//СформироватьДанныеЭлектронногоДокументаПоЭлектронномуДокументу();
	//	//КонецЕсли;
	//	ПоказатьИзображениеЭлектронногоДокумента();
	//ИначеЕсли ЗначениеЗаполнено(Документ1С) Тогда
		СформироватьДанныеЭлектронногоДокументаПоДокументу1С();
		ПоказатьИзображениеЭлектронногоДокумента();
	//Иначе
	//	ОчиститьПолеHTMLДокумента();
	//КонецЕсли;
	//УстановитьДоступностьКнопокКомандФормы();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПолеHTMLДокумента()
	АдресФайлаСПредставлениемЭлектронногоДокумента = "";
	Элементы.АдресФайлаСПредставлениемЭлектронногоДокумента.Вид = ВидПоляФормы.ПолеВвода;
	Элементы.АдресФайлаСПредставлениемЭлектронногоДокумента.МногострочныйРежим = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИзображениеЭлектронногоДокумента()
	ОчиститьПолеHTMLДокумента();
	Если ОтображатьPDF Тогда
		ПодключитьОбработчикОжидания("ПоказатьИзображениеЭлектронногоДокумента_ПослеОжидания", 0.2, Истина);
	КонецЕсли;
КонецПроцедуры // ОтобразитьИзображениеЭлектронногоДокумента()

&НаКлиенте
Процедура ПоказатьИзображениеЭлектронногоДокумента_ПослеОжидания()
	Если ЗначениеЗаполнено(мПредставлениеЭлектронногоДокументаPDF) Тогда
		СписокВременныхФайловКУдалению.Добавить(АдресВременногоФайлаДляОтображенияЭлектронногоДокумента);
		АдресВременногоФайлаДляОтображенияЭлектронногоДокумента = ПолучитьИмяВременногоФайла(".pdf");
		скEDI_ОбщегоНазначенияКлиент.СоздатьФайлИзСтрокиBase64(мПредставлениеЭлектронногоДокументаPDF, АдресВременногоФайлаДляОтображенияЭлектронногоДокумента);
		лМенеджерФайла = Новый Файл(АдресВременногоФайлаДляОтображенияЭлектронногоДокумента);
		Если лМенеджерФайла.Существует() Тогда
			Элементы.АдресФайлаСПредставлениемЭлектронногоДокумента.Вид = ВидПоляФормы.ПолеHTMLДокумента;
			АдресФайлаСПредставлениемЭлектронногоДокумента = АдресВременногоФайлаДляОтображенияЭлектронногоДокумента;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьДанныеЭлектронногоДокументаПоДокументу1С_НаСервере(ПредставлениеЭлектронногоДокументаXML, ПредставлениеЭлектронногоДокументаPDF)
	//Перем лСоответствиеСРеквизитамиЭлектронногоДокумента;	

	ПредставлениеЭлектронногоДокументаPDF     = Неопределено;
	ПредставлениеЭлектронногоДокументаXML     = Неопределено;
	//мПараметрыДляСозданияЭлектронногоДокумента = Неопределено;	
	ВерсияСодержанияЭлектронногоДокумента      = Неопределено;
	
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.Подписан")
	или  Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ОтправленВДФС")
	или  Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоКвитанциюОтДФС")
	или  Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоОтветОтДФС")
	или  Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоПодтверждениеОтДФС")
	или  Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоОтклонениеОтДФС")
	Тогда
		ТекОшибка = "";
		СодержаниеЭлектронногоДокумента = скEDI_ОбщегоНазначения.ПолучитьСодержаниеДополнительногоЭлектронногоДокументаДФС(Объект.Ссылка, ТипСодержимого, ТекОшибка);
		Если СодержаниеЭлектронногоДокумента = Неопределено Тогда
			ОтображатьОшибку = Истина;
			ОшибкаОтображения = ТекОшибка;
		Иначе
			ОтображатьОшибку = Ложь;
			ОшибкаОтображения = "";;
	
			ПредставлениеЭлектронногоДокументаXML = СодержаниеЭлектронногоДокумента.ТелоДокумента;
			Если ЗначениеЗаполнено(СодержаниеЭлектронногоДокумента.ИзображениеДокумента) Тогда  //?
				ПредставлениеЭлектронногоДокументаPDF = СодержаниеЭлектронногоДокумента.ИзображениеДокумента;
			Иначе
				Если ОтображатьPDF Тогда
					лпПараметрыФормированияPDF = Новый Структура;
					лпПараметрыФормированияPDF.Вставить("MedocBody", ПредставлениеЭлектронногоДокументаXML);
					ОтветEDIПровайдера = скEDI_КомандыEDIПровайдеру.ПолучитьРезультатКомандыEDIПровайдеру("ptn/print", лпПараметрыФормированияPDF, Ложь);
					ПредставлениеЭлектронногоДокументаPDF = ОтветEDIПровайдера.Pdf;
				Иначе
					ПредставлениеЭлектронногоДокументаPDF = "";
				КонецЕсли;
			КонецЕсли;
			
			мПредставлениеЭлектронногоДокументаPDF = ПредставлениеЭлектронногоДокументаPDF;
			мПредставлениеЭлектронногоДокументаXML = ПредставлениеЭлектронногоДокументаXML;
			Если ОтображатьКартинку Тогда
				ПечатнаяФормаЭлектронногоДокумента = Новый ТабличныйДокумент;
				Если ЗначениеЗаполнено(мПредставлениеЭлектронногоДокументаXML) Тогда
					лпПараметрыВыводаФаксимиле = Новый Структура;
					лпПараметрыВыводаФаксимиле.Вставить("MedocBody", мПредставлениеЭлектронногоДокументаXML);
					ОтветEDIПровайдера = скEDI_КомандыEDIПровайдеру.ПолучитьРезультатКомандыEDIПровайдеру("ptn/draw", лпПараметрыВыводаФаксимиле, Ложь);
					ВывестиРезультатPtnDrawНаПечатнуюФорму(ОтветEDIПровайдера, ПечатнаяФормаЭлектронногоДокумента);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ИмяФайла = "";
		ПредставлениеЭлектронногоДокументаXML = "";
		ПредставлениеЭлектронногоДокументаPDF = "";
		СообщениеОбОшибке = "";
		//Если Документы.скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН.СформироватьЭлектронныйДокумент(Объект.Ссылка, Истина, ПредставлениеЭлектронногоДокументаXML, ПредставлениеЭлектронногоДокументаPDF, ИмяФайла) Тогда
		Если Документы.скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН.СформироватьЭлектронныйДокумент(Объект, Истина, ПредставлениеЭлектронногоДокументаXML, ПредставлениеЭлектронногоДокументаPDF, ИмяФайла, СообщениеОбОшибке) Тогда
			мПредставлениеЭлектронногоДокументаPDF = ПредставлениеЭлектронногоДокументаPDF;
			мПредставлениеЭлектронногоДокументаXML = ПредставлениеЭлектронногоДокументаXML;
			
			Если ОтображатьКартинку Тогда
				ПечатнаяФормаЭлектронногоДокумента = Новый ТабличныйДокумент;
				Если ЗначениеЗаполнено(мПредставлениеЭлектронногоДокументаXML) Тогда
					лпПараметрыВыводаФаксимиле = Новый Структура;
					лпПараметрыВыводаФаксимиле.Вставить("MedocBody", мПредставлениеЭлектронногоДокументаXML);
					ОтветEDIПровайдера = скEDI_КомандыEDIПровайдеру.ПолучитьРезультатКомандыEDIПровайдеру("ptn/draw", лпПараметрыВыводаФаксимиле, Ложь);
					ВывестиРезультатPtnDrawНаПечатнуюФорму(ОтветEDIПровайдера, ПечатнаяФормаЭлектронногоДокумента);
				КонецЕсли;
			КонецЕсли;
			ОтображатьОшибку = Ложь;
			ОшибкаОтображения = "";
		Иначе
			ОтображатьОшибку = Истина;
			ОшибкаОтображения = СообщениеОбОшибке;
		КонецЕсли;
	КонецЕсли;
	УстановитьВариантОтображения();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДанныеЭлектронногоДокументаПоДокументу1С()
	СформироватьДанныеЭлектронногоДокументаПоДокументу1С_НаСервере(мПредставлениеЭлектронногоДокументаXML, мПредставлениеЭлектронногоДокументаPDF)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	лОрганизацияEDI = Неопределено;
	Если Параметры.ЗначенияЗаполнения.Свойство("ОрганизацияEDI", лОрганизацияEDI) Тогда
		Объект.ОрганизацияEDI = лОрганизацияEDI;
		Объект.Организация = ПолучитьОрганизацию1СНаСервере(Объект.ОрганизацияEDI);
		
	КонецЕсли;
	
	ПрименитьВариантОтображения();
КонецПроцедуры

&НаКлиентеНаСерверебезКонтекста
Процедура ВывестиРезультатPtnDrawНаПечатнуюФорму(ОтветEDIПровайдера, ПечатнаяФорма)
	Если ЗначениеЗаполнено(ОтветEDIПровайдера.Message) Тогда
		Сообщить(ОтветEDIПровайдера.Message);
	КонецЕсли;
	МассивСтрокBase64_ДополненаФаксимиле = Неопределено;
	СтрокаBase64_ДополненаФаксимиле = "";	
	Если ОтветEDIПровайдера.Свойство("Images", МассивСтрокBase64_ДополненаФаксимиле) Тогда
		Если ТипЗнч(МассивСтрокBase64_ДополненаФаксимиле) = Тип("Массив") Тогда
			СтрНачало = 1;
			ВысотаСтраницы = 67;
			ЭтоПерваяСтраница = Истина;
			Для Каждого СтрокаBase64_ДополненаФаксимиле Из МассивСтрокBase64_ДополненаФаксимиле Цикл
				Картинка = Новый Картинка(Base64Значение(СтрокаBase64_ДополненаФаксимиле));
				Рисунок = ПечатнаяФорма.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
				Рисунок.РазмерКартинки = РазмерКартинки.АвтоРазмер;
				Рисунок.Картинка = Картинка;
				Рисунок.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
				
				Если ЭтоПерваяСтраница Тогда
					ЭтоПерваяСтраница = Ложь;
				Иначе
					ПечатнаяФорма.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				СтрОкончание = СтрНачало + ВысотаСтраницы - 1;
				Рисунок.Расположить(ПечатнаяФорма.Область("R" + Формат(СтрНачало, "ЧГ=0") + "C1:R" + Формат(СтрОкончание, "ЧГ=0") + "C11"));
				СтрНачало = СтрОкончание + 1;
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ОтветEDIПровайдера.Свойство("Image", СтрокаBase64_ДополненаФаксимиле) Тогда
		Если ЗначениеЗаполнено(СтрокаBase64_ДополненаФаксимиле) Тогда
			Картинка = Новый Картинка(Base64Значение(СтрокаBase64_ДополненаФаксимиле));
			Рисунок = ПечатнаяФорма.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			Рисунок.РазмерКартинки = РазмерКартинки.АвтоРазмер;
			Рисунок.Картинка = Картинка;
			Рисунок.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
			Рисунок.Расположить(ПечатнаяФорма.Область("R1C1:R67C11"));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОрганизацию1СНаСервере(ОрганизацияEDI)
	Возврат ОрганизацияEDI.Организация1С;
КонецФункции

&НаКлиенте
Процедура ПрименитьСостояниеЭлектронногоДокумента()
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПустаяСсылка")
	или  Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.Создан")
	Тогда
		Элементы.ФормаПодписать.Доступность = Истина;
		Элементы.ФормаПодписатьИОтправить.Доступность = Истина;
	ИначеЕсли Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.Подписан") Тогда
		Элементы.ФормаПодписать.Доступность = Ложь;
		Элементы.ФормаПодписатьИОтправить.Доступность = Истина;
	Иначе
		Элементы.ФормаПодписать.Доступность = Ложь;
		Элементы.ФормаПодписатьИОтправить.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоОтветОтДФС") Тогда
		ТипСодержимого = ПредопределенноеЗначение("Перечисление.скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС.Ответ");
		Элементы.ТипСодержимого.ТолькоПросмотр = Ложь;
	Иначе
		ТипСодержимого = ПредопределенноеЗначение("Перечисление.скEDI_ТипыСодержимогоДополнительныхЭлектронныхДокуметовДФС.Запрос");
		Элементы.ТипСодержимого.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.Подписан")
	или  Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ОтправленВДФС")
	или  Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоКвитанциюОтДФС")
	или  Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоОтветОтДФС")
	или  Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоПодтверждениеОтДФС")
	или  Объект.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияДополнительныхЭлектронныхДокументовДФС.ПолученоОтклонениеОтДФС")
		Тогда
		
		Элементы.Организация.ТолькоПросмотр = Истина;
		Элементы.ОрганизацияEDI.ТолькоПросмотр = Истина;
		Элементы.Дата.ТолькоПросмотр = Истина;
		Элементы.Номер.ТолькоПросмотр = Истина;
		//Элементы.КтоОформилЗапрос.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Организация.ТолькоПросмотр = Ложь;
		Элементы.ОрганизацияEDI.ТолькоПросмотр = Ложь;
		Элементы.Дата.ТолькоПросмотр = Ложь;
		Элементы.Номер.ТолькоПросмотр = Ложь;
		//Элементы.КтоОформилЗапрос.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	СформироватьДанныеЭлектронногоДокументаИПоказатьИзображение();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПрименитьСостояниеЭлектронногоДокумента();
КонецПроцедуры

&НаКлиенте
Процедура Подписать(Команда)
	ИнициализироватьПодписьИОтправкуЭлектронныхДокументовВДФС(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ПодписатьИОтправить(Команда)
	ИнициализироватьПодписьИОтправкуЭлектронныхДокументовВДФС(Истина);
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокПодписантовДляЭлектронногоДокументаНаСервере(ВыполняемыеОперации, ОшибкаПолученияПодписей)
	Возврат Документы.скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН.ПолучитьСписокПодписантовДляЭлектронногоДокумента(ВыполняемыеОперации, Объект.Ссылка, ОшибкаПолученияПодписей);
КонецФункции

&НаСервере
Функция ОбработатьЭлектронныйДокументНаСервере(ВыполняемыеОперации, ТаблицаНеобходимыхПодписей, ТаблицаНеобходимыхПодписейШифрования)
	ТаблицаНастроекПодписей = ТаблицаНеобходимыхПодписей;
	ТаблицаНастроекПодписей = ?(ТипЗнч(ТаблицаНастроекПодписей) = Тип("ДанныеФормыКоллекция"), ДанныеФормыВЗначение(ТаблицаНастроекПодписей, Тип("ТаблицаЗначений")), ТаблицаНастроекПодписей);
	ТаблицаНастроекПодписейШифрования = ТаблицаНеобходимыхПодписейШифрования;
	ТаблицаНастроекПодписейШифрования = ?(ТипЗнч(ТаблицаНастроекПодписейШифрования) = Тип("ДанныеФормыКоллекция"), ДанныеФормыВЗначение(ТаблицаНастроекПодписейШифрования, Тип("ТаблицаЗначений")), ТаблицаНастроекПодписейШифрования);
	//Возврат Документы.скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН.ОбработатьЭлектронныйДокумент_Ссылка(Объект.Ссылка, ВыполняемыеОперации, ТаблицаНеобходимыхПодписей, ТаблицаНеобходимыхПодписейШифрования);
	Возврат Документы.скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН.ОбработатьЭлектронныйДокумент_Ссылка(Объект.Ссылка, ВыполняемыеОперации, ТаблицаНастроекПодписей, ТаблицаНастроекПодписейШифрования);
КонецФункции

&НаКлиенте
Процедура ИнициализироватьПодписьИОтправкуЭлектронныхДокументовВДФС(Отправлять)
	Если Модифицированность или НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		////ПоказатьВопрос
		//Ответ = Вопрос("Элемент еще не записан. Записать?", РежимДиалогаВопрос.ОКОтмена);

		//Если Ответ = КодВозвратаДиалога.ОК Тогда
			Отказ = не Записать();
		//Иначе
		//	Отказ = Истина;
		//КонецЕсли;
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВерсияМассиваДанныхПоДокументам = Новый УникальныйИдентификатор;
	
	ВыполняемыеОперации = Новый Массив;
	ВыполняемыеОперации.Добавить("Подпись");
	
	Если Отправлять Тогда  
		ВыполняемыеОперации.Добавить("ОтправкаВДФС");
	КонецЕсли;
	
	ОшибкаПолученияПодписей = "";
	//Подписанты = Документы.скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН.ПолучитьСписокПодписантовДляЭлектронногоДокумента(ВыполняемыеОперации, Объект.Ссылка, ОшибкаПолученияПодписей);
	Подписанты = ПолучитьСписокПодписантовДляЭлектронногоДокументаНаСервере(ВыполняемыеОперации, ОшибкаПолученияПодписей);
	Если ЗначениеЗаполнено(ОшибкаПолученияПодписей) Тогда
		Сообщить(ОшибкаПолученияПодписей);
		Возврат;
	КонецЕсли;
	
	лПараметрыФормыНастройкиПодписейЭлектронныхДокументов = Новый Структура("ВерсияМассиваДанныхПоДокументам,ВыполняемыеОперации,Организация,Подписанты", ВерсияМассиваДанныхПоДокументам, ВыполняемыеОперации, Объект.ОрганизацияEDI, Подписанты);
	Если скEDI_ОбщегоНазначения.ЭтоПлатформа82() Тогда		
		лФормаНастройкиПараметровПодписиДокументов = ПолучитьФорму("ОбщаяФорма.скEDI_ФормаНастройкиПодписейЭлектронныхДокументов", лПараметрыФормыНастройкиПодписейЭлектронныхДокументов, ЭтаФорма);
		ВыполнитьОперацииСЭлектроннымДокументом(лФормаНастройкиПараметровПодписиДокументов.ОткрытьМодально());
	Иначе
		скEDI_ОткрытиеФормБезМодальности.ОткрытьФормуНастройкиПараметровПодписиДокументов(лПараметрыФормыНастройкиПодписейЭлектронныхДокументов, ЭтаФорма, "ВыполнитьОперацииСЭлектроннымДокументом");
	КонецЕсли;
КонецПроцедуры // ИнициализироватьПодписьЭлектронногоДокумента()

&НаКлиенте
Процедура ВыполнитьОперацииСЭлектроннымДокументом(ПараметрыОпераций, ДополнительныеПараметрыОпераций = Неопределено) Экспорт
	Если ПараметрыОпераций <> Неопределено Тогда
		Если ПараметрыОпераций.ВерсияМассиваДанныхПоДокументам = ВерсияМассиваДанныхПоДокументам Тогда
			//Результат = Документы.скEDI_ЗапросНаПолучениеЛимитаРегистрацииВЕРНН.ОбработатьЭлектронныйДокумент_Ссылка(Объект.Ссылка, ПараметрыОпераций.ВыполняемыеОперации, ПараметрыОпераций.ТаблицаНеобходимыхПодписей, ПараметрыОпераций.ТаблицаНеобходимыхПодписейШифрования);
			Результат = ОбработатьЭлектронныйДокументНаСервере(ПараметрыОпераций.ВыполняемыеОперации, ПараметрыОпераций.ТаблицаНеобходимыхПодписей, ПараметрыОпераций.ТаблицаНеобходимыхПодписейШифрования);
			Прочитать();
			ПрименитьСостояниеЭлектронногоДокумента();
			Если ЗначениеЗаполнено(Результат) Тогда 
				скEDI_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат);	
				//ПоказатьПредупреждение(, Результат, 30);//, НСтр("ru = 'Результат проверки'; uk = 'Результат перевірки'"));
			КонецЕсли;
			Оповестить("скEDI_НеобходимоОбновитьСписокДополнительныхЭлектронныхДокументовДФС", Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияEDIПриИзменении(Элемент)
	Объект.Организация = ПолучитьОрганизацию1СНаСервере(Объект.ОрганизацияEDI);
	СформироватьДанныеЭлектронногоДокументаИПоказатьИзображение();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	СформироватьДанныеЭлектронногоДокументаИПоказатьИзображение();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СформироватьДанныеЭлектронногоДокументаИПоказатьИзображение();
КонецПроцедуры

&НаКлиенте
Процедура КтоОформилЗапросПриИзменении(Элемент)
	СформироватьДанныеЭлектронногоДокументаИПоказатьИзображение();
КонецПроцедуры

&НаКлиенте
Процедура ТипСодержимогоПриИзменении(Элемент)
	СформироватьДанныеЭлектронногоДокументаИПоказатьИзображение();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПрименитьСостояниеЭлектронногоДокумента();
КонецПроцедуры
